<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest Excel 2016 update (or standalone) package and then 
copies the package to the DeployStudio packages repository.
Requires the microsoft-recipes repo (currently https://github.com/arubdesu/microsoft-recipes,
eventually to be merged into autopkg/microsoft-recipes).

Input keys from the parent recipe:
- MSLOCALE sets the locale for a descriptive text that will be
  extracted from the Microsoft update metadata. See
  https://msdn.microsoft.com/en-us/goglobal/bb964664.aspx
  for more information about locale IDs. Defaults to 1033 for English.
- MSTYPE supports 'Combo', 'Delta', and 'Standalone' options.

Input keys from this recipe:
- DS_PKGS_PATH is the path for the Packages folder in the DeployStudio repository (trailing slash not required/desired).
  The path does not need to be on the same volume as the cache, as the pkg is being duplicated.
- DS_NAME is what the final package will be called in DeployStudio, regardless of what was generated by the parent recipe.
  It defaults to "%NAME% %MSTYPE%" (e.g., Microsoft Excel Combo), in case you wish to override this
  recipe more than once (e.g., for both Standalone and Combo).
</string>
    <key>Identifier</key>
    <string>com.github.autopkg.microsoft-recipes.ds.MicrosoftExcel</string>
    <key>Input</key>
    <dict>
        <key>DS_PKGS_PATH</key>
        <string>/Volumes/DSServer/Users/Shared/Deploy/Packages</string>
        <key>DS_NAME</key>
        <string>%NAME% %MSTYPE%</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.2</string>
    <key>ParentRecipe</key>
    <string>com.github.autopkg.microsoft-recipes.download.MicrosoftExcel</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>StopProcessingIf</string>
            <key>Arguments</key>
            <dict>
                <key>predicate</key>
                <string>download_changed == FALSE</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%pathname%</string>
                <key>destination_path</key>
                <string>%DS_PKGS_PATH%/%DS_NAME%.pkg</string>
                <key>overwrite</key>
                <true/>
            </dict>
        </dict>
    </array>
</dict>
</plist>