<policy>
    <general>
        <name>%PROD_NAME%</name>
        <enabled>true</enabled>
        <trigger>EVENT</trigger>
        <trigger_other>%TRIGGER_OTHER%</trigger_other>
        <frequency>%FREQUENCY%</frequency>
        <category>
            <name>%POLICY_CATEGORY%</name>
        </category>
    </general>
    <scope>
        <!--Scope added by JSSImporter-->
    </scope>
    <package_configuration>
        <!--Package added by JSSImporter-->
    </package_configuration>
    <scripts>
        <!--Scripts added by JSSImporter-->
    </scripts>
    <self_service>
        <use_for_self_service>false</use_for_self_service>
    </self_service>
    <maintenance>
        <recon>true</recon>
    </maintenance>
</policy>
