<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Finds latest Lync installer, downloads the disk image and extracts the pkg.
Set VERSION to a specific version number to download that version instead.
Set CULTURE_CODE to a different value to get a different localization. See
http://msdn.microsoft.com/en-us/library/ee825488(v=cs.20).aspx for a table of Culture Codes.</string>
	<key>Identifier</key>
	<string>com.github.microsoft-recipes.munki.LyncInstaller</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>MSLync</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/Office2011</string>
		<key>VERSION</key>
		<string>latest</string>
		<key>CULTURE_CODE</key>
		<string>0409</string>
		<key>pkginfo</key>
		<dict>
			<key>blocking_applications</key>
			<array>
				<string>MSN Messenger</string>
				<string>Microsoft Lync</string>
				<string>Microsoft Error Reporting</string>
				<string>Microsoft Communicator</string>
				<string>Microsoft Messenger</string>
			</array>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.3.1</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>MSLyncURLandUpdateInfoProvider</string>
			<key>Arguments</key>
			<dict>
				<key>culture_code</key>
				<string>%CULTURE_CODE%</string>
				<key>munki_update_name</key>
				<string>%NAME%</string>
				<key>version</key>
				<string>%VERSION%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/Lync Installer.pkg</string>
				<key>expected_authority_names</key>
				<array>
					<string>Developer ID Installer: Microsoft Corporation</string>
					<string>Developer ID Certification Authority</string>
					<string>Apple Root CA</string>
				</array>
			</dict>
		</dict>
		<dict>
			<key>Comment</key>
			<string>Merge input pkginfo and additional_pkginfo generated by MSLyncURLandUpdateInfoProvider</string>
			<key>Processor</key>
			<string>MunkiPkginfoMerger</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
